<script setup>
import Card from "primevue/card";
// import { ref, activate } from "vue";

// const items = activate([
//   {
//     title: "探索未来职业道路：从岗位需求入手",
//     context:
//       "面对职业生涯规划，尤其是早期阶段，许多人会感到迷茫。一个重要步骤是从当前所处领域开始，了解目标行业的不同岗位及其所需技能。通过使用招聘软件，可以观察并了解到各种职位的具体要求，如Python编程或数据结构知识。此外，应关注沟通与表达能力的培养，这些都是几乎所有岗位共通的基本素质。同时，积极参加社交活动和社团，以增强人际交往能力和解决实际问题的能力。无论是技术岗位还是管理岗位，扎实的基础知识和技能至关重要。初步而言，技术方面的需求包括对编程和框架应用的理解，而管理岗位则更看重沟通协调能力和解决问题的能力。总之，明确的职业规划需基于对自身兴趣、行业需求及个人技能的全面考量。",
//   },
//   {
//     title: "探索未来职业道路：从岗位需求入手",
//     context:
//       "面对职业生涯规划，尤其是早期阶段，许多人会感到迷茫。一个重要步骤是从当前所处领域开始，了解目标行业的不同岗位及其所需技能。通过使用招聘软件，可以观察并了解到各种职位的具体要求，如Python编程或数据结构知识。此外，应关注沟通与表达能力的培养，这些都是几乎所有岗位共通的基本素质。同时，积极参加社交活动和社团，以增强人际交往能力和解决实际问题的能力。无论是技术岗位还是管理岗位，扎实的基础知识和技能至关重要。初步而言，技术方面的需求包括对编程和框架应用的理解，而管理岗位则更看重沟通协调能力和解决问题的能力。总之，明确的职业规划需基于对自身兴趣、行业需求及个人技能的全面考量。",
//   },
// ]);
</script>

<template>
  <div class="main flex justify-center flex-col items-center">
    <Card class="max-w-4xl mt-6">
      <template #title>探索未来职业道路：从岗位需求入手</template>
      <template #content>
        <p class="m-0">
          面对职业生涯规划，尤其是早期阶段，许多人会感到迷茫。一个重要步骤是从当前所处领域开始，了解目标行业的不同岗位及其所需技能。通过使用招聘软件，可以观察并了解到各种职位的具体要求，如Python编程或数据结构知识。此外，应关注沟通与表达能力的培养，这些都是几乎所有岗位共通的基本素质。同时，积极参加社交活动和社团，以增强人际交往能力和解决实际问题的能力。无论是技术岗位还是管理岗位，扎实的基础知识和技能至关重要。初步而言，技术方面的需求包括对编程和框架应用的理解，而管理岗位则更看重沟通协调能力和解决问题的能力。总之，明确的职业规划需基于对自身兴趣、行业需求及个人技能的全面考量。
        </p>
      </template>
    </Card>
    <Card class="max-w-4xl mt-6">
      <template #title>探索未来职业道路：从岗位需求入手</template>
      <template #content>
        <p class="m-0">
          面对职业生涯规划，尤其是早期阶段，许多人会感到迷茫。一个重要步骤是从当前所处领域开始，了解目标行业的不同岗位及其所需技能。通过使用招聘软件，可以观察并了解到各种职位的具体要求，如Python编程或数据结构知识。此外，应关注沟通与表达能力的培养，这些都是几乎所有岗位共通的基本素质。同时，积极参加社交活动和社团，以增强人际交往能力和解决实际问题的能力。无论是技术岗位还是管理岗位，扎实的基础知识和技能至关重要。初步而言，技术方面的需求包括对编程和框架应用的理解，而管理岗位则更看重沟通协调能力和解决问题的能力。总之，明确的职业规划需基于对自身兴趣、行业需求及个人技能的全面考量。
        </p>
      </template>
    </Card>
    <Card class="max-w-4xl mt-6">
      <template #title>探索未来职业道路：从岗位需求入手</template>
      <template #content>
        <p class="m-0">
          面对职业生涯规划，尤其是早期阶段，许多人会感到迷茫。一个重要步骤是从当前所处领域开始，了解目标行业的不同岗位及其所需技能。通过使用招聘软件，可以观察并了解到各种职位的具体要求，如Python编程或数据结构知识。此外，应关注沟通与表达能力的培养，这些都是几乎所有岗位共通的基本素质。同时，积极参加社交活动和社团，以增强人际交往能力和解决实际问题的能力。无论是技术岗位还是管理岗位，扎实的基础知识和技能至关重要。初步而言，技术方面的需求包括对编程和框架应用的理解，而管理岗位则更看重沟通协调能力和解决问题的能力。总之，明确的职业规划需基于对自身兴趣、行业需求及个人技能的全面考量。
        </p>
      </template>
    </Card>
  </div>
</template>

<style lang="scss" scoped></style>
